app/controllers/project/overview_controller.rb

SELECT * FROM "milestones" WHERE (date_due = '2009-07-09' and project_id = 1 and is_complete = 'f') ORDER BY date_due
SELECT * FROM "to_do_lists" WHERE ("to_do_lists".project_id = 1)
SELECT * FROM "messages" WHERE ("messages".project_id = 1)
---
  def index
    @subnav = { :title => 'Project overview & activity' }

    milestones = @project.all_milestones
    if @project.to_do_lists.length > 0
      todos = ToDoItem.find(:all, :conditions => ["to_do_list_id in (#{@project.to_do_lists.collect{|tdl| tdl.id }.join(',')})"])
    else
      todos = []
    end
    messages = @project.messages

    @data = Hash.new

    # Add Milestones
    milestones.each do |milestone|
      if @data[milestone.date_due].blank?
        @data[milestone.created_at.strftime("%Y-%m-%d")] = []
      end
      @data[milestone.created_at.strftime("%Y-%m-%d")] << milestone
    end

    todos.each do |todo|
      if @data[todo.created_at.strftime("%Y-%m-%d")].blank?
        @data[todo.created_at.strftime("%Y-%m-%d")] = []
      end
      @data[todo.created_at.strftime("%Y-%m-%d")] << todo
    end

    messages.each do |message|