app/controllers/project/todos_controller.rb

  def index
    @subnav = { :title => 'To-do lists' }
    @to_do_lists = ToDoList.find(:all, :conditions => ["project_id = ? and account_id = ?", @project.id, @account.id], :order => "name", :include => [:to_do_items])
---
SELECT * FROM "to_do_lists" WHERE (project_id = 1 and account_id = 1) ORDER BY name