app/controllers/main/companies_controller.rb

SELECT * FROM "companies" WHERE ("companies".account_id = 1)
---
  def index
    @subnav = { :title => 'Every company and person in your system' }
    @companies = @account.companies
    @personal_people = Person.find(:all, :conditions => ["company_id = ? and account_id = ?", 0, @account.id])

INSERT INTO "companies" ("name", "city", "fax_number", "zip", "created_at", "country", "created_by_id", "office_number", "updated_at", "account_id", "can_view_private", "timezone", "address_1", "logo_id", "address_2", "web_address", "state") VALUES('WKMS', 'Bluffdale', '', '84065', '2009-07-09 16:21:15', 'United States', 1, '', '2009-07-09 16:21:15', 1, 't', NULL, '14807 S Heritage Crest Way', NULL, 'Suite A', 'http://www.solidcoresolutions.com', 'UT')
---
  def create_company
    @side_contents = "company"
    @subnav = { :title => 'Update Company' }
    @company = Company.new(params[:company])
    @company.account_id = @account.id
    @company.created_by_id = @user.id