app/controllers/main/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "start_controller", "updated_at", "account_id", "primary_company_id", "display_overview_page_announcement", "is_public", "overview_page_announcement") VALUES('Billing Manager', '2009-07-09 16:14:54', 'overview', '2009-07-09 16:14:54', 1, 0, 't', 'f', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.')
---
  def create
    @project = Project.new(params[:project])
    @project.account_id = @account.id
    if @project.save

SELECT * FROM "projects" WHERE (id = '1' and account_id = 1) LIMIT 1
---
  def go_to_project
    project = Project.find(:first, :conditions => ["id = ? and account_id = ?", params[:id], @account.id])