app/controllers/main/settings_controller.rb

  def revert_colors_to_original
    @account.color_schemes.each { |cs| cs.destroy }
---
DELETE FROM "color_schemes" WHERE "id" = 1
SELECT * FROM "color_schemes" WHERE ("color_schemes".account_id = 1)

  def edit_file_category
    @file_category = FileCategory.find(:first, :conditions => ["id = ? and account_id = ?", params[:id], @account.id])
---
SELECT * FROM "file_categories" WHERE (id = '2' and account_id = 1) LIMIT 1

  def update_website
    if @account.update_attributes(params[:website])
---
UPDATE "accounts" SET "updated_at" = '2009-07-09 16:26:58', "logo_file_size" = 2867, "logo_updated_at" = '2009-07-09 16:26:56', "logo_content_type" = 'image/png', "logo_file_name" = 'logo.png' WHERE "id" = 1