app/controllers/stylesheets_controller.rb

  def load_color_schemes
    @color_schemes = {}
    if (session[:account_id])
      account = Account.find(session[:account_id])
      account.color_schemes.each { |cs| @color_schemes[cs.name] = cs.hex_value }
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
SELECT * FROM "color_schemes" WHERE ("color_schemes".account_id = 1)