app/controllers/welcome_controller.rb

  def signup
    @account = Account.new
    @account.timezone = "Mountain Time (US & Canada)" # Default
    @person = Person.new
    if request.post?
      @account = Account.new(params[:account])
      @person = Person.new(params[:person])
      @person.is_admin = true
      @person.is_account_owner = true
      @person.created_by_id = 0
---
INSERT INTO "accounts" ("company", "logo_updated_at", "created_at", "country", "sub_domain", "updated_at", "domain", "logo_file_name", "timezone", "terms_of_service", "site_name", "newsletter", "logo_content_type", "logo_file_size", "email_notifications") VALUES('WKMS', NULL, '2009-07-09 16:12:16', 'United States', 'wkms', '2009-07-09 16:12:16', 'taskb.us', NULL, NULL, 'yes', 'WKMS''s Task Bus', 't', NULL, NULL, 't')